BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega32U2.PIC
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="CLKSEL1" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EXCKSEL" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="RCCKSEL" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="------nn" edc:cname="CLKSTA" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EXTON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="n-n-----" edc:cname="USBCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="FRZCLK" edc:desc="Freeze USB Clock Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="USBE" edc:desc="USB macro Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD9" edc:offset="0x7"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="-----nnn" edc:cname="UDCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DETACH" edc:desc="Detach Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RMWKUP" edc:desc="Remote Wake-up Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTCPU" edc:desc="USB Reset CPU Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnnnn-n" edc:cname="UDINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPI" edc:desc="Suspend Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFI" edc:desc="Start Of Frame Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTI" edc:desc="End Of Reset Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPI" edc:desc="Wake-up CPU Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSMI" edc:desc="End Of Resume Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSMI" edc:desc="Upstream Resume Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnn-n" edc:cname="UDIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPE" edc:desc="Suspend Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFE" edc:desc="Start Of Frame Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTE" edc:desc="End Of Reset Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPE" edc:desc="Wake-up CPU Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSME" edc:desc="End Of Resume Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSME" edc:desc="Upstream Resume Interrupt Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="UDADDR" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UADD" edc:desc="USB Address Bits" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="Address Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE4" edc:access="-----nnnnnnnnnnn" edc:cname="UDFNUM" edc:nzwidth="0x10" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FNUM" edc:desc="Frame Number Upper Flag" edc:nzwidth="0xB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE6" edc:access="---n----" edc:cname="UDMFN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="FNCERR" edc:desc="Frame Number CRC Error Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnn" edc:cname="UEINTX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINI" edc:desc="Transmitter Ready Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDI" edc:desc="STALLEDI Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTI" edc:desc="Received OUT Data Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPI" edc:desc="Received SETUP Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTI" edc:desc="NAK OUT Received Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWAL" edc:desc="Read/Write Allowed Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINI" edc:desc="NAK IN Received Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
